BtmsGateway.Test/Services/Converter/Fixtures/ClearanceRequestSoap.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
  <soap:Header>
    <oas:Security soap:role="system" soap:mustUnderstand="true">
      <oas:UsernameToken>
        <oas:Username>systemID=ALVSHMRCCDS,ou=gsi systems,o=defra</oas:Username>
        <oas:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</oas:Password>
      </oas:UsernameToken>
    </oas:Security>
  </soap:Header>
  <soap:Body>
    <m:ALVSClearanceRequest xmlns:m="http://submitimportdocumenthmrcfacade.types.esb.ws.cara.defra.com">
      <m:ServiceHeader>
        <m:SourceSystem>CDS</m:SourceSystem>
        <m:DestinationSystem>ALVS</m:DestinationSystem>
        <m:CorrelationId>179120009100989</m:CorrelationId>
        <m:ServiceCallTimestamp>2013-10-18T16:55:00.000</m:ServiceCallTimestamp>
      </m:ServiceHeader>
      <m:Header>
        <m:EntryReference>24DSW01TST9009AR63</m:EntryReference>
        <m:EntryVersionNumber>1</m:EntryVersionNumber>
        <m:DeclarationUCR>4DP99000000000-TST63</m:DeclarationUCR>
        <m:DeclarationType>S</m:DeclarationType>
        <m:ArrivalDateTime>201310220900</m:ArrivalDateTime>
        <m:SubmitterTURN>123456789012345</m:SubmitterTURN>
        <m:DeclarantId>GBTRANSITAIR</m:DeclarantId>
        <m:DeclarantName>TRANSITAIR.GB</m:DeclarantName>
        <m:DispatchCountryCode>GB</m:DispatchCountryCode>
        <m:GoodsLocationCode>BELBELBEL</m:GoodsLocationCode>
        <m:MasterUCR>GB/TRANSITAIR-01</m:MasterUCR>
      </m:Header>
      <m:Item>
        <m:ItemNumber>1</m:ItemNumber>
        <m:CustomsProcedureCode>4000061</m:CustomsProcedureCode>
        <m:TaricCommodityCode>0808108010</m:TaricCommodityCode>
        <m:GoodsDescription>Test Test</m:GoodsDescription>
        <m:ConsigneeId>NIIMPORTS</m:ConsigneeId>
        <m:ConsigneeName>Importers Ltd</m:ConsigneeName>
        <m:ItemNetMass>31</m:ItemNetMass>
        <m:ItemSupplementaryUnits>0</m:ItemSupplementaryUnits>
        <m:ItemThirdQuantity>0</m:ItemThirdQuantity>
        <m:ItemOriginCountryCode>GB</m:ItemOriginCountryCode>
        <m:Document>
          <m:DocumentCode>N851</m:DocumentCode>
          <m:DocumentReference>GBCHD2024.7360439</m:DocumentReference>
          <m:DocumentStatus>St</m:DocumentStatus>
          <m:DocumentControl>S</m:DocumentControl>
        </m:Document>
        <m:Check>
          <m:CheckCode>H219</m:CheckCode>
          <m:DepartmentCode>PHSI</m:DepartmentCode>
        </m:Check>
      </m:Item>
      <m:Item>
        <m:ItemNumber>2</m:ItemNumber>
        <m:CustomsProcedureCode>4000061</m:CustomsProcedureCode>
        <m:TaricCommodityCode>0808108010</m:TaricCommodityCode>
        <m:GoodsDescription>Test Test</m:GoodsDescription>
        <m:ConsigneeId>NIIMPORTS</m:ConsigneeId>
        <m:ConsigneeName>Importers Ltd</m:ConsigneeName>
        <m:ItemNetMass>11</m:ItemNetMass>
        <m:ItemSupplementaryUnits>0</m:ItemSupplementaryUnits>
        <m:ItemThirdQuantity>0</m:ItemThirdQuantity>
        <m:ItemOriginCountryCode>GB</m:ItemOriginCountryCode>
        <m:Document>
          <m:DocumentCode>N851</m:DocumentCode>
          <m:DocumentReference>GBCHD2024.7360439</m:DocumentReference>
          <m:DocumentStatus>St</m:DocumentStatus>
          <m:DocumentControl>S</m:DocumentControl>
        </m:Document>
        <m:Check>
          <m:CheckCode>H219</m:CheckCode>
          <m:DepartmentCode>PHSI</m:DepartmentCode>
        </m:Check>
      </m:Item>
      <m:Item>
        <m:ItemNumber>3</m:ItemNumber>
        <m:CustomsProcedureCode>4000061</m:CustomsProcedureCode>
        <m:TaricCommodityCode>0709601000</m:TaricCommodityCode>
        <m:GoodsDescription>Test Test</m:GoodsDescription>
        <m:ConsigneeId>NIIMPORTS</m:ConsigneeId>
        <m:ConsigneeName>Importers Ltd</m:ConsigneeName>
        <m:ItemNetMass>43</m:ItemNetMass>
        <m:ItemSupplementaryUnits>0</m:ItemSupplementaryUnits>
        <m:ItemThirdQuantity>0</m:ItemThirdQuantity>
        <m:ItemOriginCountryCode>GB</m:ItemOriginCountryCode>
        <m:Document>
          <m:DocumentCode>N851</m:DocumentCode>
          <m:DocumentReference>GBCHD2024.7360439</m:DocumentReference>
          <m:DocumentStatus>St</m:DocumentStatus>
          <m:DocumentControl>S</m:DocumentControl>
        </m:Document>
        <m:Document>
          <m:DocumentCode>N002</m:DocumentCode>
          <m:DocumentReference>GBCHD2024.7360439</m:DocumentReference>
          <m:DocumentStatus>St</m:DocumentStatus>
          <m:DocumentControl>S</m:DocumentControl>
        </m:Document>
        <m:Check>
          <m:CheckCode>H219</m:CheckCode>
          <m:DepartmentCode>PHSI</m:DepartmentCode>
        </m:Check>
        <m:Check>
          <m:CheckCode>H218</m:CheckCode>
          <m:DepartmentCode>HMI</m:DepartmentCode>
        </m:Check>
      </m:Item>
      <m:Item>
        <m:ItemNumber>4</m:ItemNumber>
        <m:CustomsProcedureCode>4000061</m:CustomsProcedureCode>
        <m:TaricCommodityCode>0709601000</m:TaricCommodityCode>
        <m:GoodsDescription>Test Test</m:GoodsDescription>
        <m:ConsigneeId>NIIMPORTS</m:ConsigneeId>
        <m:ConsigneeName>Importers Ltd</m:ConsigneeName>
        <m:ItemNetMass>22</m:ItemNetMass>
        <m:ItemSupplementaryUnits>0</m:ItemSupplementaryUnits>
        <m:ItemThirdQuantity>0</m:ItemThirdQuantity>
        <m:ItemOriginCountryCode>GB</m:ItemOriginCountryCode>
        <m:Document>
          <m:DocumentCode>N851</m:DocumentCode>
          <m:DocumentReference>GBCHD2024.7360439</m:DocumentReference>
          <m:DocumentStatus>St</m:DocumentStatus>
          <m:DocumentControl>S</m:DocumentControl>
        </m:Document>
        <m:Document>
          <m:DocumentCode>N002</m:DocumentCode>
          <m:DocumentReference>GBCHD2024.7360439</m:DocumentReference>
          <m:DocumentStatus>St</m:DocumentStatus>
          <m:DocumentControl>S</m:DocumentControl>
        </m:Document>
        <m:Check>
          <m:CheckCode>H219</m:CheckCode>
          <m:DepartmentCode>PHSI</m:DepartmentCode>
        </m:Check>
        <m:Check>
          <m:CheckCode>H218</m:CheckCode>
          <m:DepartmentCode>HMI</m:DepartmentCode>
        </m:Check>
      </m:Item>
    </m:ALVSClearanceRequest>
  </soap:Body>
</soap:Envelope>